#include <iostream>

using namespace std;
int a[19][19];
int main() {

    for(int i=0; i<19; i++){
        for(int j=0; j<19; j++){
            cin >> a[i][j];     // 검:1, 흰:2, 알X:0
        }
    }
    
    for(int i=0; i<19; i++){
        for(int j=0; j<19; j++){
            // 아래 방향
            if(0 <= i+4 && i+4 < 19){
                // 맨 아래칸이 범위 안에 들어올 경우에만 확인
                if(a[i][j] == 1 && a[i+1][j] == 1 && a[i+2][j] == 1 && a[i+3][j] == 1 && a[i+4][j] == 1){
                    cout << 1 << '\n';
                    cout << i+3 << ' ' << j+1 << '\n';
                    return 0;
                }
                if(a[i][j] == 2 && a[i+1][j] == 2 && a[i+2][j] == 2 && a[i+3][j] == 2 && a[i+4][j] == 2){
                    cout << 2 << '\n';
                    cout << i+3 << ' ' << j+1 << '\n';
                    return 0;
                }
            }

            // 우 방향
            if(0 <= j+4 && j+4 < 19){
                // 맨 오른쪽 칸이 범위 안에 들어올 경우에만 확인
                if(a[i][j] == 1 && a[i][j+1] == 1 && a[i][j+2] == 1 && a[i][j+3] == 1 && a[i][j+4] == 1){
                    cout << 1 << '\n';
                    cout << i+1 << ' ' << j+3 << '\n';
                    return 0;
                }
                if(a[i][j] == 2 && a[i][j+1] == 2 && a[i][j+2] == 2 && a[i][j+3] == 2 && a[i][j+4] == 2){
                    cout << 2 << '\n';
                    cout << i+1 << ' ' << j+3 << '\n';
                    return 0;
                }
            }

            // 우하 방향
            if(0 <= i+4 && i+4 < 19 && 0 <= j+4 && j+4 < 19){
                // 맨 아래칸에 범위 안에 들어올 경우에만 확인
                if(a[i][j] == 1 && a[i+1][j+1] == 1 && a[i+2][j+2] == 1 && a[i+3][j+3] == 1 && a[i+4][j+4] == 1){
                    cout << 1 << '\n';
                    cout << i+3 << ' ' << j+3 << '\n';
                    return 0;
                }
                if(a[i][j] == 2 && a[i+1][j+1] == 2 && a[i+2][j+2] == 2 && a[i+3][j+3] == 2 && a[i+4][j+4] == 2){
                    cout << 2 << '\n';
                    cout << i+3 << ' ' << j+3 << '\n';
                    return 0;
                }
            }

            // 좌하 방향
            if(0 <= i-4 && i-4 < 19 && 0 <= j-4 && j-4 < 19){
                // 맨 아래칸에 범위 안에 들어올 경우에만 확인
                if(a[i][j] == 1 && a[i-1][j-1] == 1 && a[i-2][j-2] == 1 && a[i-3][j-3] == 1 && a[i-4][j-4] == 1){
                    cout << 1 << '\n';
                    cout << i-3 << ' ' << j-3 << '\n';
                    return 0;
                }
                if(a[i][j] == 2 && a[i-1][j-1] == 2 && a[i-2][j-2] == 2 && a[i-3][j-3] == 2 && a[i-4][j-4] == 2){
                    cout << 2 << '\n';
                    cout << i-3 << ' ' << j-3 << '\n';
                    return 0;
                }
            }
        }
    }

    return 0;
}